/** 保存人工收集到的题库和答案信息
 * Created by kaicui on 17/4/24.
 *
 * 30%、权利和责任清单、165、192、220、
 * 5000万吨、居住属性、自由裁量权、中国工匠、
 * 手机国内长途和漫游费、同线同标同质、4.5万户、
 * 钢铁、煤炭、增长6.5%、左右单一窗口、全域旅游、居住证制度、
 * 5700多亿、特别提款权、免除、股权期权和分红、河长制、大灾保险、
 * 优质教育、蓝天保卫战、地方政府、一半以上、 四、三、数字家庭、
 * 3500亿、非公有制经济、新一轮东北振兴、600万套、
 * 自由裁量权、海绵城市、不低于5%幅度、放管服、
 * 全部取消,1314万人
 *
 */

String.prototype.replaceAll = function(search, replacement) {
    var target = this;
    return target.replace(new RegExp(search, 'g'), replacement);
};
module.exports= {
    topics:[
        {
            topic:"2016年，国内生产总值达到74.4万亿元，增长6.7%，名列世界前茅，对全球经济增长的贡献率超过（  ）。 ",
            answer:".mugine_class_85"
        },
        {
            topic:"以（  ）行业为重点去产能，2016年全年退出钢铁产能超过6500万吨、煤炭产能超过2.9亿吨，超额完成年度目标任务，分流职工得到较好安置。",
            answer:".mugine_class_167"
        },
        {
            topic:"2016年全面推开营改增试点，全年降低企业税负（  ）多亿元，所有行业实现税负只减不增。",
            answer:".mugine_class_151"
        },
        {
            topic:"2016年，制定了自然资源统一确权登记办法，开展省以下环保机构监测监察执法垂直管理、耕地轮作休耕改革等试点，全面推行（  ），健全生态保护补偿机制。",
            answer:".mugine_class_215"
        },
        {
            topic:"今年发展的主要预期目标是：国内生产总值增长（  ）左右，在实际工作中争取更好结果。",
            answer:".mugine_class_311"
        },
        {
            topic:"今年赤字率保持不变，主要是为了进一步减税降费，全年再减少企业税负（  ）亿元左右、涉企收费约2000亿元，一定要让市场主体有切身感受。",
            answer:".mugine_class_359"
        },
        {
            topic:"全面清理规范政府性基金，取消城市公用事业附加等基金，授权（  ）自主减免部分基金。",
            answer:".mugine_class_471"
        },
        {
            topic:"全面实行清单管理制度，制定国务院部门权力和责任清单，扩大市场准入负面清单试点，减少政府的（  ），增加市场的自主选择权。",
            answer:".mugine_class_535"
        },
        {
            topic:"坚持权利平等、机会平等、规则平等，进一步放宽（  ）市场准入。",
            answer:".mugine_class_615"
        },
        {
            topic:"今年网络提速降费要迈出更大步伐，年内全部取消（  ），大幅降低中小企业互联网专线接入资费，降低国际长途电话费，推动“互联网+”深入发展。",
            answer:".mugine_class_727"
        },
        {
            topic:"深化户籍制度改革，今年实现进城落户1300万人以上，加快（  ）全覆盖。",
            answer:".mugine_class_775"
        },
        {
            topic:"2016年，全年城镇新增就业（ ）万人。高校毕业生就业创业人数再创新高。年末城镇登记失业率4.02%，为多年来最低。",
            answer:".mugine_class_101"
        },
        {
            topic:"人民币已正式纳入国际货币基金组织",
            answer:".mugine_class_231"
        },
        {
            topic:"（  ）农村贫困家庭学生普通高中学杂费。2016年资助各类学校家庭困难学生8400多万人次。",
            answer:".mugine_class_279"
        },
        {
            topic:"各级政府要坚持过紧日子，中央部门要带头，一律按不低于（  ）的幅度压减一般性支出，决不允许增加“三公”经费，挤出更多资金用于减税降费，坚守节用裕民的正道。",
            answer:".mugine_class_375"
        },
        {
            topic:"坚持住房的（  ），落实地方政府主体责任，加快建立和完善促进房地产市场平稳健康发展的长效机制，以市场为主满足多层次需求，以政府为主提供基本保障。",
            answer:".mugine_class_439"
        },
        {
            topic:"今年在13个粮食主产省选择部分县市，对适度规模经营农户实施（  ），调整部分财政救灾资金予以支持，提高保险理赔标准，完善农业再保险体系，以持续稳健的农业保险助力现代农业发展。",
            answer:".mugine_class_567"
        },
        {
            topic:"简化增值税税率结构，今年由（  ）档税率简并至（  ）档，营造简洁透明、更加公平的税收环境，进一步减轻企业税收负担。",
            answer:".mugine_class_599"
        },
        {
            topic:"完善主体功能区制度和生态补偿机制，建立资源环境监测预警机制，开展健全国家自然资源资产管理体制试点，出台（  ）总体方案，为生态文明建设提供有力制度保障。",
            answer:".mugine_class_679"
        },
        {
            topic:`切实落实高校和科研院所自主权，落实
（  ）等激励政策，落实科研经费和项目管理制度改革，让科研人员不再为杂事琐事分心劳神。`,
            answer:".mugine_class_807"
        },
        {
            topic:`在提前完成本届政府减少行政审批事项三分之一目标的基础上，2016年又取消`,
            answer:".mugine_class_183"
        },
        {
            topic:`编制了西部大开发“十三五”规划，实施`,
            answer:".mugine_class_247"
        },
        {
            topic:`推进政务公开，省级政府部门 （  ）全面公布。`,
            answer:".mugine_class_295"
        },
        {
            topic:`推广国际贸易（  ），实现全国通关一体化。`,
            answer:".mugine_class_487"
        },
        {
            topic:`取消或停征中央涉企行政事业性收费35项，收费项目再减少（  ），保留的项目要尽可能降低收费标准。`,
            answer:".mugine_class_519"
        },
        {
            topic:`引导企业增品种、提品质、创品牌，扩大内外销产品（  ）实施范围，更好满足消费升级需求。`,
            answer:".mugine_class_759"
        },
        {
            topic:`今年发展的主要预期目标是：国内生产总值增长（  ）左右，在实际工作中争取更好结果。`,
            answer:".mugine_class_311"
        },
        {
            topic:`统一城乡义务教育学生“两免一补”政策，加快实现城镇义务教育公共服务常住人口全覆盖，持续改善薄弱学校办学条件`,
            answer:".mugine_class_327"
        },
        {
            topic:`（  ）农村贫困家庭学生普通高中学杂费。2016年资助各类学校家庭困难学生8400多万人次。`,
            answer:".mugine_class_279"
        },
        {
            topic:`完善旅游设施和服务，大力发展乡村、休闲、（  ）旅游。`,
            answer:".mugine_class_695"
        },
        {
            topic:`坚决打好（  ）。今年二氧化硫、氮氧化物排放量要分别下降3%，重点地区细颗粒物（PM2.5）浓度明显下降。`,
            answer:".mugine_class_407"
        },
        {
            topic:`今年再完成棚户区住房改造（  ）万套，继续发展公租房，因地制宜提高货币化安置比例，加强配套设施建设和公共服务，让更多住房困难家庭告别棚户区，让广大人民群众在住有所居中创造新生活。`,
            answer:".mugine_class_455"
        },
        {
            topic:`今年要再压减钢铁产能（  ）万吨左右，退出煤炭产能1.5亿吨以上。`,
            answer:".mugine_class_391"
        },
        {
            topic:`扩大（  ）、在线教育等信息消费。`,
            answer:".mugine_class_711"
        },
        {
            topic:`全面推开公立医院综合改革，（  ）药品加成，协调推进医疗价格、人事薪酬、药品流通、医保支付方式等改革。`,
            answer:".mugine_class_631"
        },
        {
            topic:`统筹城市地上地下建设，再开工建设城市地下综合管廊2000公里以上，启动消除城区重点易涝区段三年行动，推进（  ）建设，使城市既有“面子”、更有“里子”。`,
            answer:".mugine_class_791"
        },
        {
            topic:`我们一定要让企业和群众更多感受到（  ）改革成效，着力打通“最后一公里”，坚决除烦苛之弊、施公平之策、开便利之门。`,
            answer:".mugine_class_551"
        },
        {
            topic:`要大力弘扬工匠精神，厚植工匠文化，恪尽职业操守，崇尚精益求精，培育众多（  ），打造更多享誉世界的“中国品牌”，推动中国经济发展进入质量时代。`,
            answer:".mugine_class_647"
        },
    ],
    /**
     * 根据传入的题干，选择题目答案
     * @param subject
     */
    find:function (subject) {
        var _s = subject.substr(0,12);
        var _topic = this.topics.filter((item)=>{
            item.topic = item.topic.replaceAll("）","").replaceAll("（","").replaceAll(" ","").replace(/&nbsp;/g, "'").replace(/\s+/g, "");
            // console.log(`index of [${_s}] in [${item.topic}] is:[${item.topic.indexOf(_s)}]`);
            return item.topic.indexOf(_s)>-1
        });
        if(_topic && _topic.length>0){
            return _topic[0].answer;
        }
        return "";
    }
}
